import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-greek',
  templateUrl: './greek.component.html',
  styleUrls: ['./greek.component.css']
})
export class GreekComponent implements OnInit {
  greekQuote = ["στους παληούς καιρούς", "την αγάπη και τον θάνατο", "Για να ξαναπή τη θαυμασία τους ιστορία: το μάγευμά τους", "της χαρές τους", "τους πόνους τους και το θάνατό τους", "έτσι όπως εβγήκε από τα βάθη του Κελτικού ονείρου και", "εγοήτευσε και συνετάραξε την ψυχή των Γάλλων του δωδεκάτου αιώνος", "εχρειάσθη να αναπαραστήση", "με την δύναμη μιας φαντασίας συμπαθητικής και μιας υπομονητικής σπουδής", "την ίδια εκείνη την ψυχή", "την ώρα που μόλις έβγαινε από την ομίχλη", "και που η συγκινήσεις αυτές της ήτανε όλως διόλου καινούργιες", "Την ψυχή που αφηνότανε να κατακλυσθή", "απ αυτές χωρίς να σκέπτεται να της αναλύση", "και προσήρμοζε χωρίς να το κατορθώνη πλήρως", "το παραμύθι που την έθελγε στης συνθήκες της συνηθισμένης υπάρξεώς της", "Αν είχε φθάσει μέχρι των ημερών μας μία πλήρης Γαλλική απόδοσις του θρύλου", "για να γνωρίση τον θρύλον αυτό στους σύγχρονους αναγνώστες", "θα μπορούσε να περιορισθή σε μια πιστή μετάφρασι", "Η ιδιότροπη μοίρα που θέλησε να μας φθάση μόνον σε σκορπισμένα κομμάτια", "τον υπεχρέωσε ν αναλάβη πειο ενεργητικό ρόλο", "για τον οποίον δεν έφθανε πεια νάναι σοφός", "για τον οποίον χρειαζότανε νάναι ποιητής", "Από τα μυθιστορήματα του Τριστάνου", "όσων γνωρίζουμε στην ύπαρξι", "και που όλα θα ήσαν μεγάλης εκτάσεως", "του Κρετιέν ντε Τροά και του Λασέβρ εχάθησαν ολόκληρα", "Από του Μπερούλ εσώθησαν τρεις χιλιάδες στίχοι περίπου", "Άλλοι τόσοι του Τομάς. Κάποιου άλλου", "χίλιοι πεντακόσιοι", "Έπειτα υπάρχουν ξένες μεταφράσεις", "Τρεις απ αυτές αποδίδουν αρκετά πλήρως", "ως προς το βάθος", "αλλ όχι κι ως προς τη φόρμα", "χάρις στης ξένες μεταφράσεις", "και που αποτελεί το κέντρο της ιστορίας", "περίπου. Αφού προσηνατολίσθη έτσι καλά στο πνεύμα του αρχαίου ιστορικού", "αφού αφωμοίωσε τον αφελή τρόπο του τού αισθάνεσθαι", "τον απλό τρόπο του τού σκέπτεσθαι", "μέχρι ως την παιδική κάποτε αμηχανία της", "αφηγήσεως και την ελαφρώς αδεξία χάρι του ύφους του", "ξανάδωσε στον κορμόν εκείνο κεφάλι και μέλη", "όχι με μια μηχανική προσαρμογή", "αλλά μ ένα είδος οργανικής αναδημιουργίας", "έτσι καθώς μας την παρουσιάζουν τα ζώα εκείνα", "που ακρωτηριασμένα", "συμπληρώνονται εκ νέου με την εσωτερική", "ους δύναμη στο σχέδιο της αρχικής φόρμας τους."];
  randomGreek = Math.floor(Math.random() * this.greekQuote.length);
  constructor() { }

  getGreekQuote(){
    console.log(this.greekQuote[this.randomGreek]);
    return this.greekQuote[this.randomGreek];
  }

  ngOnInit() {
  }

}
